<?php

namespace App\Model;

use DateTimeInterface;
use Illuminate\Database\Eloquent\Model;

class SsbfzStatistics extends Model
{
    public static $list = [
        'SSHFSS'    => ['i26.9'],       // 手术患者手术后肺栓塞发生例数
        'SSHSJMXS'  => ['i80.2','i82.8'],   // 手术患者手术后深静脉血栓发生例数和发生率
        'SSHBXZ'    => ['A40.0','A40.1','A40.2','A40.3','A40.8','A40.9','A41.0','A41.1','A41.2','A41.3','A41.4','A41.5','A41.8','A41.9','T81.411'], // 手术患者手术后败血症发生例数
        'SSHCXHXZ'  => ['T81.0'],       // 手术患者手术后出血或血肿发生例数
        'SSHSKLK'   => ['T81.3'],       // 手术患者手术伤口裂开发生例数
        'SSHCS'     => ['R96.0','R96.1','I46.1'],   // 手术患者手术后猝死发生例数
        'SSHHXSJ'   => ['J96.0','J96.1','J96.9'],   // 手术患者手术后呼吸衰竭发生例数
        'SSHSLDXSLF'=> ['E89.0','E89.1','E89.2','E89.3','E89.4','E89.5','E89.6','E89.8','E89.9'],   // 手术患者手术后生理/代谢紊乱发生例数
        'SSCZGR'    => ['T81.4'],           // 手术/操作相关感染发生例数
        'SSGCZYWYL' => ['T81.5','T81.6'],   // 手术过程中异物遗留发生例数
        'MZBFZ'     => ['T88.3','T88.4','T88.5'],   // 手术患者麻醉并发症发生例数
        'FBGRYFJNBQ'=> ['J95.2','J95.3','J95.4','J95.5','J95.8','J95.9','J98.4'],   // 手术患者肺部感染与肺机能不全发生例数
        'YWCCSHSLS' => ['T81.2'],       // 手术意外穿刺伤或撕裂伤发生例数
        'SSHJXSSJ'  => ['N17.0','N17.1','N17.2','N17.3','N17.4','N17.5','N17.6','N17.7','N17.8','N17.9','N99.0'],   // 手术后急性肾衰竭发生例数
        'GSTQG'     => [
            'K91.0','K91.1','K91.2','K91.3','K91.4','K91.5','K91.8','K91.9',
            'I97.0','I97.1','I97.8','I97.9',
            'G97.0','G97.1','G97.8','G97.9','I60','I61','I62','I63','I64',
            'H59.0','H59.8','H59.9',
            'H95.0','H95.1','H95.8','H95.9',
            'M96.0','M96.1','M96.2','M96.3','M96.4','M96.5','M96.6','M96.8','M96.9',
            'N99.0','N99.1','N99.2','N99.3','N99.4','N99.5','N99.8','N99.9',
            'K11.4','S04.3','S04.5'
        ],// 各系统/器官术后并发症发生例数
        'XTQGXH'    => ['K91.0','K91.1','K91.2','K91.3','K91.4','K91.5','K91.8','K91.9'],   // 各系统/器官术后并发症发生例数（消化）
        'XTQGXUNHUAN' => ['I97.0','I97.1','I97.8','I97.9'], // 各系统/器官术后并发症发生例数（循环）
        'XTQGSJ'    => ['G97.0','G97.1','G97.8','G97.9','I60','I61','I62','I63','I64'],     // 各系统/器官术后并发症发生例数（神经）
        'XTQGYHFQ'  => ['H59.0','H59.8','H59.9'],   // 各系统/器官术后并发症发生例数（眼和附器）
        'XTQGEHRC'  => ['H95.0','H95.1','H95.8','H95.9'],   // 各系统/器官术后并发症发生例数（耳和乳突）
        'XTQGJRGG'  => ['M96.0','M96.1','M96.2','M96.3','M96.4','M96.5','M96.6','M96.8','M96.9'],   // 各系统/器官术后并发症发生例数（肌肉骨骼）
        'XTQGMNSZ'  => ['N99.0','N99.1','N99.2','N99.3','N99.4','N99.5','N99.8','N99.9'],   // 各系统/器官术后并发症发生例数（泌尿生殖）
        'XTQGKQ'    => ['K11.4','S04.3','S04.5'],   // 各系统/器官术后并发症发生例数（口腔）
        'ZRW'       => [
            'T82.0','T82.1','T82.2','T82.3','T82.4','T82.5','T82.6','T82.7','T82.8','T82.9',
            'T83.0','T83.1','T83.2','T83.3','T83.4','T83.5','T83.6','T83.8','T83.9',
            'T84.0','T84.1','T84.2','T84.3','T84.4','T84.5','T84.6','T84.7','T84.8','T84.9',
            'T85.0','T85.1','T85.2','T85.3','T85.4','T85.5','T85.6','T85.7','T85.8','T85.9'
        ],//植入物的并发症
        'ZRWXZHXG'  => ['T82.0','T82.1','T82.2','T82.3','T82.4','T82.5','T82.6','T82.7','T82.8','T82.9'],   // 植入物的并发症（心脏和血管）
        'ZRWMNSZD'  => ['T83.0','T83.1','T83.2','T83.3','T83.4','T83.5','T83.6','T83.8','T83.9'],   // 植入物的并发症（泌尿生殖道）
        'ZRWGK'     => ['T84.0','T84.1','T84.2','T84.3','T84.4','T84.5','T84.6','T84.7','T84.8','T84.9'],   // 植入物的并发症（骨科）
        'ZRWQT'     => ['T85.0','T85.1','T85.2','T85.3','T85.4','T85.5','T85.6','T85.7','T85.8','T85.9'],   // 植入物的并发症（其他）
        'YZBFZ'     => ['T86.0','T86.1','T86.2','T86.3','T86.4','T86.8','T86.9'],   // 移植的并发症发生例数
        'ZZHJZ'     => ['T87.0','T87.1','T87.2','T87.3','T87.4','T87.5','T87.6'],   // 再植和截肢的并发症发生例数
        'JRCZHQT'   => ['T81.1','T81.7','T81.8','T81.9'],   // 介入操作与手术后患者其他并发症发生例数
    ];

    public static $fieldList = [
        'SSHFSS'    => '手术患者手术后肺栓塞发生例数',
        'SSHSJMXS'  => '手术患者手术后深静脉血栓发生例数和发生率',
        'SSHBXZ'    => '手术患者手术后败血症发生例数',
        'SSHCXHXZ'  => '手术患者手术后出血或血肿发生例数',
        'SSHSKLK'   => '手术患者手术伤口裂开发生例数',
        'SSHCS'     => '手术患者手术后猝死发生例数',
        'SSHHXSJ'   => '手术患者手术后呼吸衰竭发生例数',
        'SSHSLDXSLF'=> '手术患者手术后生理/代谢紊乱发生例数',
        'SSCZGR'    => '手术/操作相关感染发生例数',
        'SSGCZYWYL' => '手术过程中异物遗留发生例数',
        'MZBFZ'     => '手术患者麻醉并发症发生例数',
        'FBGRYFJNBQ'=> '手术患者肺部感染与肺机能不全发生例数',
        'YWCCSHSLS' => '手术意外穿刺伤或撕裂伤发生例数',
        'SSHJXSSJ'  => '手术后急性肾衰竭发生例数',
        'GSTQG'     => '各系统/器官术后并发症发生例数',
        'XTQGXH'    => '各系统/器官术后并发症发生例数（消化）',
        'XTQGXUNHUAN' => '各系统/器官术后并发症发生例数（循环）',
        'XTQGSJ'    => '各系统/器官术后并发症发生例数（神经）',
        'XTQGYHFQ'  => '各系统/器官术后并发症发生例数（眼和附器）',
        'XTQGEHRC'  => '各系统/器官术后并发症发生例数（耳和乳突）',
        'XTQGJRGG'  => '各系统/器官术后并发症发生例数（肌肉骨骼）',
        'XTQGMNSZ'  => '各系统/器官术后并发症发生例数（泌尿生殖）',
        'XTQGKQ'    => '各系统/器官术后并发症发生例数（口腔）',
        'ZRW'       => '植入物的并发症',
        'ZRWXZHXG'  => '植入物的并发症（心脏和血管）',
        'ZRWMNSZD'  => '植入物的并发症（泌尿生殖道）',
        'ZRWGK'     => '植入物的并发症（骨科）',
        'ZRWQT'     => '植入物的并发症（其他）',
        'YZBFZ'     => '移植的并发症发生例数',
        'ZZHJZ'     => '再植和截肢的并发症发生例数',
        'JRCZHQT'   => '介入操作与手术后患者其他并发症发生例数',
    ];

    protected $table = 'ssbfz_statistics';
    protected function serializeDate(DateTimeInterface $date)
    {
        return $date->format('Y-m-d H:i:s');
    }

    
}
